app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "asd@asd.com"]]
---
  def create
  	@existedUser = User.find_by(email: params[:user][:email])